app/Controllers/Servicios.php

    public function index()
    {
        $servicios = $this->servicios->where('Estado', 1)->findAll();
---
SELECT *
FROM `tbl_servicio`
WHERE `Estado` = 1

    public function Eliminados()
    {
        $servicios = $this->servicios->where('Estado', 2)->findAll();
---
SELECT *
FROM `tbl_servicio`
WHERE `Estado` = 2