app/Models/ServiciosModel.php

UPDATE `tbl_servicio` SET `Estado` = '1'
WHERE `tbl_servicio`.`PK_codigo_Se` IN ('46')
---
    public function desactivar_Servicio($id, $Accion)
    {
        $data = ['Estado' => $Accion];
        $Response = $this->update($id, $data);